# IsInRoom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoomTag..::..IsInRoom Property
RoomTag Class See Also
---
Identifies if the tag is located in a room.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsInRoom { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsInRoom As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsInRoom {
	bool get ();
}
```

# Remarks
In some cases the tag may not be located in a room so it looses temporairly an association with the room.
# See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace